channel_RSM_300/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       17670;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       17730;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          300;
        startFace       18030;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          18000;
        startFace       18330;
    }
)

// ************************************************************************* //
