channel_RSM_300/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "31187";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
9000
(
(0.00286402 -1.13043e-08 0)
(0.00286951 -4.05534e-09 0)
(0.00287019 3.94385e-09 0)
(0.00286573 1.03459e-08 0)
(0.00285787 1.11558e-08 0)
(0.00285149 3.81315e-09 0)
(0.00285214 -7.42567e-09 0)
(0.00286004 -1.20163e-08 0)
...
)
;

boundaryField
{
    walls
    {
        type            noSlip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
