channel_RSM_300/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "31187";
    object      turbulenceProperties:R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor> 
9000
(
(2.35875e-06 -1.42686e-08 -0 2.35875e-06 -0 2.35875e-06)
(2.36783e-06 -1.43806e-08 -0 2.36783e-06 -0 2.36783e-06)
(2.35639e-06 -1.42759e-08 -0 2.35639e-06 -0 2.35639e-06)
(2.32748e-06 -1.39836e-08 -0 2.32748e-06 -0 2.32748e-06)
(2.29372e-06 -1.36336e-08 -0 2.29372e-06 -0 2.29372e-06)
(2.27791e-06 -1.34591e-08 -0 2.27791e-06 -0 2.27791e-06)
(2.29637e-06 -1.36323e-08 -0 2.29637e-06 -0 2.29637e-06)
(2.33637e-06 -1.40404e-08 -0 2.33637e-06 -0 2.33637e-06)
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform (0 -0 -0 0 -0 0);
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
