channel_RSM_300/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "31187";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];


internalField   nonuniform List<scalar> 
9000
(
0.000506163
0.00050706
0.000505974
0.000503181
0.000499872
0.000498292
0.000500084
0.000503989
...
)
;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform 0.003376;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
