channel_RSM_300/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "31187";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];
oriented        oriented;


internalField   nonuniform List<scalar> 
17670
(
2.55052e-07
-6.56854e-10
2.55326e-07
-2.74412e-10
2.55158e-07
1.68308e-10
2.54611e-07
5.4733e-10
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
-2.54395e-07
-7.81001e-07
-1.31648e-06
-1.82727e-06
-2.29453e-06
-2.72014e-06
-3.11349e-06
-3.4836e-06
...
)
;
    }
    outlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
300
(
2.54395e-07
7.81001e-07
1.31648e-06
1.82727e-06
2.29453e-06
2.72014e-06
3.11349e-06
3.4836e-06
...
)
;
    }
    sides
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
