channel_RSM_300/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
60
(
(-0.000128765 2.15365e-09 0)
(-0.000129012 8.60103e-10 0)
(-0.000129043 -6.14418e-10 0)
(-0.000128842 -1.8522e-09 0)
(-0.000128489 -2.09275e-09 0)
(-0.000128202 -8.01583e-10 0)
(-0.000128231 1.30014e-09 0)
(-0.000128586 2.25833e-09 0)
...
)
;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
