channel_RSM_300/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver              GAMG;
        smoother            DIC;

        tolerance           1e-4;
        relTol              0.01;
    }

    "(U|k|epsilon|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-4;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;

    pRefCell 1000;
    pRefValue 0;

    residualControl
    {
        p       5e-4;
        U       1e-4;
        epsilon 1e-4;
        R       1e-4;
    }
}

relaxationFactors
{
    equations
    {
        U       0.7;
        k       0.7;
        R       0.7;
        epsilon 0.7;
    }
}


// ************************************************************************* //

